{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.4.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "Letter_Generator", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}}, {"class_name": "Dense", "config": {"name": "L_G_Dense1", "trainable": true, "dtype": "float32", "units": 12544, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "L_G_BN1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "L_G_Dropout1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Reshape", "config": {"name": "L_G_Reshape", "trainable": true, "dtype": "float32", "target_shape": [7, 7, 256]}}, {"class_name": "Conv2DTranspose", "config": {"name": "L_G_Transpose1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "L_G_BN2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "L_G_Dropout2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "L_G_Traspose2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}, {"class_name": "BatchNormalization", "config": {"name": "L_G_BN3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dropout", "config": {"name": "L_G_Dropout3", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2DTranspose", "config": {"name": "L_G_Conv2D3", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "L_G_BN1/gamma", "shape": [12544], "dtype": "float32"}, {"name": "L_G_BN1/beta", "shape": [12544], "dtype": "float32"}, {"name": "L_G_BN1/moving_mean", "shape": [12544], "dtype": "float32"}, {"name": "L_G_BN1/moving_variance", "shape": [12544], "dtype": "float32"}, {"name": "L_G_BN2/gamma", "shape": [128], "dtype": "float32"}, {"name": "L_G_BN2/beta", "shape": [128], "dtype": "float32"}, {"name": "L_G_BN2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "L_G_BN2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "L_G_BN3/gamma", "shape": [64], "dtype": "float32"}, {"name": "L_G_BN3/beta", "shape": [64], "dtype": "float32"}, {"name": "L_G_BN3/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "L_G_BN3/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "L_G_Conv2D3/kernel", "shape": [5, 5, 1, 64], "dtype": "float32"}, {"name": "L_G_Conv2D3/bias", "shape": [1], "dtype": "float32"}, {"name": "L_G_Dense1/kernel", "shape": [100, 12544], "dtype": "float32"}, {"name": "L_G_Dense1/bias", "shape": [12544], "dtype": "float32"}, {"name": "L_G_Transpose1/kernel", "shape": [5, 5, 128, 256], "dtype": "float32"}, {"name": "L_G_Transpose1/bias", "shape": [128], "dtype": "float32"}, {"name": "L_G_Traspose2/kernel", "shape": [5, 5, 64, 128], "dtype": "float32"}, {"name": "L_G_Traspose2/bias", "shape": [64], "dtype": "float32"}]}]}